#include<stdio.h>


char * KEYWORD[] =
{"아메리카노", "콘센트", "구조체", "백팩",
"고양이", "초코라떼", "인테리어", "쿠폰",
"마우스",  "눈사람", "삼국시대", "콩국수",
"사과", "딸기", "무말랭이", "지방",
"드라이플라워", "블럭", "입구", "출구",
"이해관계", "선인장", "오프숄더", "원피스",
"엑소", "김준수", "마녀", "일박이일",
"제주도", "최지웅", "김주희", "박주훈",
"이경원", "빵집", "분화구", "포크레인",
"영화", "엄마", "아빠", "해외여행",
"참치김밥", "노래방", "김치볶음밥", "삶은계란", 
"알고리즘", "밥버거", "한경직", "정보대",
"곡성", "벚꽃엔딩", "아이언맨", "짜파구리", 
"불닭볶음면","비빔면" , "쫄면", "바르셀로나", 
"서울", "오사카", "하노이", "런던", 
"시드니", "뉴욕", "한복", "파리", 
"타이페이", "디즈니", "미키마우스", "곰돌이푸우", 
"우유식빵", "태양의후예","시크릿가든","공주의남자",
"안경"};

int KEYWORD_NUM = ( sizeof(KEYWORD)/8 ) + ( sizeof(KEYWORD)%8 );


int select_keyword();	//랜덤으로 키워드 선택하여 인덱스 값 반환


int select_keyword()
{
		int index = 0;
		srand(time(NULL));
		index = rand()%KEYWORD_NUM;
		return index;
}
